In [76]:
student_scores={
    "name":["Student1","Student2", "Student3"],
    "maths": [35, 20,40],
     "english": [50, 70,60],
     "science": [60, 40,60]
}

In [78]:
student_scores

{'name': ['Student1', 'Student2', 'Student3'],
 'maths': [35, 20, 40],
 'english': [50, 70, 60],
 'science': [60, 40, 60]}

In [8]:
import pandas as pd

In [82]:
student_scores

{'name': ['Student1', 'Student2', 'Student3'],
 'maths': [35, 20, 40],
 'english': [50, 70, 60],
 'science': [60, 40, 60]}

In [84]:
ss=pd.DataFrame(student_scores)

In [86]:
ss

       name  maths  english  science
0  Student1     35       50       60
1  Student2     20       70       40
2  Student3     40       60       60

In [88]:
ss['Average'] = ss[['maths', 'english', 'science']].mean(axis=1)

print(student_scores)

{'name': ['Student1', 'Student2', 'Student3'], 'maths': [35, 20, 40], 'english': [50, 70, 60], 'science': [60, 40, 60]}

In [90]:
ss

       name  maths  english  science    Average
0  Student1     35       50       60  48.333333
1  Student2     20       70       40  43.333333
2  Student3     40       60       60  53.333333

In [92]:
# Find the highest average score
max_average = ss['Average'].max()

# Filter the DataFrame to find the student(s) with the highest average score
students_with_highest_average = ss[ss['Average'] == max_average]

print(students_with_highest_average)

       name  maths  english  science    Average
2  Student3     40       60       60  53.333333

In [7]:
# Sort the DataFrame based on the average score in descending order
ss_sorted = ss.sort_values(by='Average', ascending=False)

print(ss_sorted)

NameError: name 'ss' is not defined

In [96]:
ss

       name  maths  english  science    Average
0  Student1     35       50       60  48.333333
1  Student2     20       70       40  43.333333
2  Student3     40       60       60  53.333333